console.log('Hello, World!');
alert ("Работа с массивами в JS")

// Напишите функцию, принимающую на вход массив вещественных
// чисел и возвращающую сумму элементов, расположенных после
// последнего элемента равного нулю.
function one3(arr) {
    let s = 0;
    let n = -2;
    for (let i = 0; i < arr.length; i++) {
        if (arr[i] === 0) n = i;
    }
    if ((n >= 0) && (n < arr.length - 1)) {
        for (let i = n+1; i < arr.length; i++) {
            s += arr[i];
        }
    }
    console.log(s);
    alert (s);
}
one3([6, 0, 1, 5, 0, 10, 4]);
one3([28, 0, 25, 42, 0, 26, 13,]);
one3([28, 25, 42, 26, 13,]);
one3([0, 25, 42, 26, 13,]);
one3([28, 25, 42, 26, 13,]);


// Напишите функцию, принимающую на вход вещественную
// прямоугольную матрицу и возвращающую сумму элементов в тех
// строках, которые содержат хотя бы один отрицательный элемент.
function two3(matr) {
    let s = 0;
    let ar = [];
    
    for (let i = 0; i < matr.length; i++) {
        for (let j = 0; j < matr[i].length; j++) {
            if (matr[i][j] < 0) {
                ar.push(i);
                j = matr[i].length - 1;
            }
        }
    }

    for (const i of ar) {
        for (let j = 0; j < matr[i].length; j++) {
            s += matr[i][j];
        }
    }
    console.log(s);
    alert (s);
}

two3([[1, -2],
    [3, 5],
    [13, 4]]);

two3([[16, 3, 7],
    [-5, 15, -1],
    [-4, 2, 9],
    [-8, 6, 3]]);

two3([[1, 2, -3],
    [-11, -5, 2],
    [4, 10, 5]]);





